%%清空坏境
clear;
clc;
close all;

%%初始化参数
% 船沿南北方向的测线航行时，总测线长度最短
% D0指船在左端第一条测线航行时距海底的深度
% m指最左端测线距海域左边的水平距离
D0=(110+2*1852*tan(1.5*pi/180))*(1-sqrt(3)*tan(1.5*pi/180));
m = D0*sin(60*pi/180)*cos(1.5*pi/180)/sin(28.5*pi/180);

%%求解船在第i条测线上航行时距海底的深度
% w0指船在左端第一条测线航行时波束覆盖宽度在坡面上的长度
% d指两相邻相邻测线之间的水平距离
% h0指船在左端第二条测线航行时距海底的深度
for i = 1:100  
w0 = sin(60*pi/180)*D0/sin(28.5*pi/180)+sin(60*pi/180)*D0/sin(31.5*pi/180);
% 利用重叠率为10%联立递推求解求解船在第i条测线上航行时距海底的深度
syms d h0
f1 = D0 -d*tan(1.5*pi/180)-h0;
f2 = (-0.1*(D0*sin(60*pi/180)/sin(28.5*pi/180)+...
    D0*sin(60*pi/180)/sin(31.5*pi/180))+h0*sin(60*pi/180)/sin(28.5*pi/180)...
    +h0*sin(60*pi/180)/sin(31.5*pi/180))*sin(148.5*pi/180)/sin(30*pi/180)-d;
[d,h0] = solve(f1,f2);
c(i) = double(d);
D0=h0;
end

%%求解满足覆盖整个海域的最小测线条数以及总测线的长度
l = m;
for i = 1:100
    l =l+c(i);
    if l>1852*4
        ind = i;
        break;
    end 
end
num=i;
length=2*1852*num;
    



    